In [2]:
# import libraries
import numpy as np
import pandas as pd

In [22]:
# create dataframe from dict of series of summer olympics : 1996 to 2012
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(["London","Beijing","Athens","Sydney","Atlanta"],index=[2012,2008,2004,2000,1996])

df_olympic_series = pd.DataFrame({"No. of Participating Countries ": olympic_series_participation,
                                 "Host Cities ": olympic_series_country})

In [23]:
# displat content of the dataset
df_olympic_series

      No. of Participating Countries  Host Cities
2012                              205       London
2008                              204      Beijing
2004                              201       Athens
2000                              200       Sydney
1996                              197      Atlanta

In [24]:
# view dataframe describe
df_olympic_series.describe()

       No. of Participating Countries
count                         5.000000
mean                        201.400000
std                           3.209361
min                         197.000000
25%                         200.000000
50%                         201.000000
75%                         204.000000
max                         205.000000

In [25]:
# view top 2 records
df_olympic_series.head(2)

      No. of Participating Countries  Host Cities
2012                              205       London
2008                              204      Beijing

In [26]:
# view last 3 records
df_olympic_series.tail(3)

      No. of Participating Countries  Host Cities
2004                              201       Athens
2000                              200       Sydney
1996                              197      Atlanta

In [27]:
# view indexes of dataset
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [28]:
# view columns of the dataset
df_olympic_series.columns

Index(['No. of Participating Countries ', 'Host Cities '], dtype='object')

# Select Data

In [29]:
# select data for Host Cities
df_olympic_series["Host Cities "]

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities , dtype: object

In [30]:
# another data selection No. of participating Countries
df_olympic_series["No. of Participating Countries "]

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No. of Participating Countries , dtype: int64

In [33]:
# select label-location based access by label
df_olympic_series.loc[2012]

No. of Participating Countries        205
Host Cities                        London
Name: 2012, dtype: object

In [38]:
df_olympic_series.iloc[0:2]

      No. of Participating Countries  Host Cities
2012                              205       London
2008                              204      Beijing

In [39]:
# Integer-location based data selection by index value
df_olympic_series.iat[3,1]

'Sydney'

In [43]:
# select data element by condition where number of participated countries are more than 200
df_olympic_series[df_olympic_series["No. of Participating Countries "]>200]

      No. of Participating Countries  Host Cities
2012                              205       London
2008                              204      Beijing
2004                              201       Athens